ush/LouisianaPurchase.tex
% Created 2021-09-15 Wed 14:55
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[dvipsnames]{xcolor}
\usepackage[colorlinks=true, linkcolor=Blue, citecolor=BrickRed, urlcolor=PineGreen]{hyperref}
\usepackage{indentfirst}
\setmainfont[Ligatures=TeX]{Alegreya}
\setmonofont[Ligatures=TeX]{Liga SFMono Nerd Font}
% features: (par-sep)
\setlength{\parskip}{\baselineskip}
\setlength{\parindent}{0pt}

% end features
\author{Shaurya Singh}
\date{\today}
\title{Louisiana Purchase Assignment \#1}
\colorlet{greenyblue}{blue!70!green}
\colorlet{blueygreen}{blue!40!green}
\providecolor{link}{named}{greenyblue}
\providecolor{cite}{named}{blueygreen}
\hypersetup{
  pdfauthor={Shaurya Singh},
  pdftitle={Louisiana Purchase Assignment \#1},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 28.0.50 (Org mode 9.5)},
  pdflang={English},
  breaklinks=true,
  colorlinks=true,
  linkcolor=,
  urlcolor=link,
  citecolor=cite
}
\urlstyle{same}
\begin{document}

\maketitle

\section{Did the Federalists have real concerns over the purchase of the Louisiana Territory, or did they just hate Jefferson?}
\label{sec:orgbbb7887}
Based on the documents, Federalists opposed the Louisiana Purchase because they
  believed that it would lead to a power shift towards Jefferson and
  the Republican Party. Jefferson saw the purchase as an opportunity to create
  economy and trade through the purchase of port cities (New Orleans) and vast
  amounts of land. In document A, Alexander Hamilton (a Federalist) mentions

\emph{``This purchase will probably make it seem like Mr. Jefferson is brilliant. Any man, however, who possesses any amount of intelligence, will easily see that the purchase is the result of lucky coincidences and unexpected circumstances and not the result of any wise or thoughtful actions on the part of Jefferson’s administration.''}

As you can see, the federalists agree with the expansion, saying it was
``essential to the peace and prosperity of our'' earlier in the document.
However, they feel like crediting Jefferson for the expansion is unjust, and
that it was just a matter of luck. This further supported by the following quote from
Document B:

\emph{``I am disgusted with the men who now rule us. The coward at the head [Jefferson] is like a French revolutionary. While he talks about humanity, he enjoys the utter destruction of his opponents. We have too long witnesses his general wickedness—his cruel removals of faithful officers and the substitution of corruption and immorality for honesty.'''}

The Federalists aren't evaluating the benefits and drawbacks of the Louisiana
Purchase itself, but rather the man behind it. Similar to modern politics, it
sounds like their goal is to discourage the rival political party regardless of
his contributions to America
\end{document}
